CBMJasonZhu/iNMECH_IM31_LIGHTS/LIN/arch/stm8L/lin_def_stm8L_gen.h
  #elif (LIN_ZERO_PAGE_SIZE  >=  8 * LIN_IFC_NR_MAX)
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE5 @tiny
    #define LIN_ZERO_PAGE6 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE5 page0
    #define LIN_ZERO_PAGE6 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE5 __tiny
    #define LIN_ZERO_PAGE6 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  7 * LIN_IFC_NR_MAX)
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE5 @tiny
    #define LIN_ZERO_PAGE8 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE5 page0
    #define LIN_ZERO_PAGE8 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE5 __tiny
    #define LIN_ZERO_PAGE8 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  6 * LIN_IFC_NR_MAX)
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
    #define LIN_ZERO_PAGE5 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
    #define LIN_ZERO_PAGE5 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
    #define LIN_ZERO_PAGE5 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  5 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
    #define LIN_ZERO_PAGE4 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
    #define LIN_ZERO_PAGE4 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
    #define LIN_ZERO_PAGE4 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  4 * LIN_IFC_NR_MAX)
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
    #define LIN_ZERO_PAGE3 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
    #define LIN_ZERO_PAGE3 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
    #define LIN_ZERO_PAGE3 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  3 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE3 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE3 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE3 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  2 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
    #define LIN_ZERO_PAGE2 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
    #define LIN_ZERO_PAGE2 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
    #define LIN_ZERO_PAGE2 __tiny
	#endif
	
    
  #elif (LIN_ZERO_PAGE_SIZE  >=  1 * LIN_IFC_NR_MAX)
  
  #ifdef __COSMIC__
	#define LIN_ZERO_PAGE1 @tiny
	#elif __RAISONANCE__
	#define LIN_ZERO_PAGE1 page0
	#elif __IAR__
	#define LIN_ZERO_PAGE1 __tiny
	#endif
	
    
  #endif
#endif

#ifndef LIN_ZERO_PAGE1
  #define LIN_ZERO_PAGE1
#endif

#ifndef LIN_ZERO_PAGE2
  #define LIN_ZERO_PAGE2
#endif

#ifndef LIN_ZERO_PAGE3
  #define LIN_ZERO_PAGE3
#endif

#ifndef LIN_ZERO_PAGE4
  #define LIN_ZERO_PAGE4
#endif

#ifndef LIN_ZERO_PAGE5
  #define LIN_ZERO_PAGE5
#endif

#ifndef LIN_ZERO_PAGE6
  #define LIN_ZERO_PAGE6
#endif

#ifndef LIN_ZERO_PAGE7
  #define LIN_ZERO_PAGE7
#endif

#ifndef LIN_ZERO_PAGE8
  #define LIN_ZERO_PAGE8
#endif

#ifndef LIN_ZERO_PAGE9
  #define LIN_ZERO_PAGE9
#endif

#ifndef LIN_ZERO_PAGE10
  #define LIN_ZERO_PAGE10
#endif

#ifndef LIN_ZERO_PAGE11
  #define LIN_ZERO_PAGE11
#endif

#ifndef LIN_ZERO_PAGE12
  #define LIN_ZERO_PAGE12
#endif

#ifndef LIN_ZERO_PAGE13
  #define LIN_ZERO_PAGE13
#endif

#ifndef LIN_ZERO_PAGE14
  #define LIN_ZERO_PAGE14
#endif

#ifndef LIN_ZERO_PAGE15
 #define LIN_ZERO_PAGE15
#endif

#endif /* LIN_DEF_STM8L_GEN_H */

/*
 * eof lin_def_stm8L_gen.h
 */
